# StairsLandingtypeThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsLandingtypeThickness Property
ParameterTypeId Class See Also
---
"Monolithic Thickness": Default thickness
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsLandingtypeThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsLandingtypeThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsLandingtypeThickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace